output/posts/2017-08-10-org-clock-sum-and-the-time-range-parameters.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>org-clock-sum and the time range parameters | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-08-10-org-clock-sum-and-the-time-range-parameters.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html" title="Summarizing the clocking time in a journal entry" type="text/html">
<link rel="next" href="2017-08-11-passing-in-seconds-to-org-clock-sum.html" title="Passing in seconds to org-clock-sum" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="org-clock-sum and the time range parameters">
<meta property="og:url" content="https://example.com/posts/2017-08-10-org-clock-sum-and-the-time-range-parameters.html">
<meta property="og:description" content='org-clock-sum and the time range parameters


Emacs function org-clock-sum has the following signature

(defun org-clock-sum (&amp;optional tstart tend headline-filter propname)


where "TSTART and TEND c'>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-10T22:06:00+02:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="orgmode">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-08-10-org-clock-sum-and-the-time-range-parameters.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">org-clock-sum and the time range parameters</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-08-10T22:06:00+02:00" itemprop="datePublished" title="2017-08-10 22:06">2017-08-10 22:06</time></a></p>
            
        <p class="sourceline"><a href="2017-08-10-org-clock-sum-and-the-time-range-parameters.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">org-clock-sum and the time range parameters</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs function org-clock-sum has the following signature
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">org-clock-sum</span> <span class="p">(</span><span class="nf">&amp;optional</span> <span class="nv">tstart</span> <span class="nv">tend</span> <span class="nv">headline-filter</span> <span class="nv">propname</span><span class="p">)</span>
</pre></div>
<p>
where "TSTART and TEND can mark a time range to be considered". So, what kind
of values are TSTART and TEND?
</p>

<p>
Looking at the implementation, you see that org-clock-sum converts these
parameters when they are string values:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">stringp</span> <span class="nv">tstart</span><span class="p">)</span> <span class="p">(</span><span class="nf">setq</span> <span class="nv">tstart</span> <span class="p">(</span><span class="nf">org-time-string-to-seconds</span> <span class="nv">tstart</span><span class="p">)))</span>
<span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">stringp</span> <span class="nv">tend</span><span class="p">)</span> <span class="p">(</span><span class="nf">setq</span> <span class="nv">tend</span> <span class="p">(</span><span class="nf">org-time-string-to-seconds</span> <span class="nv">tend</span><span class="p">)))</span>
</pre></div>
<p>
So the first thing we can deduce from this is that TSTART and TEND can each
denote a time string that together denote the "time range to be considered".
</p>

<p>
org-time-string-to-seconds passes this time string to org-time-string-to-time,
which passes it to org-parse-time-string. The documentation of the latter
mentions that it parses "the standard Org-mode time string". A quick Google
search did not turn up a proper definition of this standard string. Some trial
and error seems to indicate that every string that contains a YYYY-MM-DD
substring is valid.
</p>

<p>
All this means that the yesterday's snippet can be simplified to
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">my-org-clock-sum-current-item</span> <span class="p">()</span>
  <span class="s">"Return time, clocked on current item in total."</span>
  <span class="p">(</span><span class="nf">save-excursion</span>
    <span class="p">(</span><span class="nf">save-restriction</span>
      <span class="p">(</span><span class="nf">org-narrow-to-subtree</span><span class="p">)</span>
      <span class="p">(</span><span class="nf">org-clock-sum</span> <span class="s">"2017-08-09"</span> <span class="s">"2017-08-10"</span><span class="p">))))</span>

<span class="p">(</span><span class="nf">org-map-entries</span> <span class="ss">'my-org-clock-sum-current-item</span> <span class="s">"emacs"</span> <span class="ss">'agenda</span><span class="p">)</span><span class="nv">y</span>
</pre></div>

<p>
I do not think passing strings to org-clock-sum is the approach to take. In the
end we have to call org-clock-sum on subsequent days. Unless org-mode has some
functions to "increase" a time string by one day, this might be difficult using
strings.
</p>

<p>
Fortunately, org-clock-sum also seems to work with seconds. Once the time
strings are converted to seconds, the rest of org-clock-sum works with these
seconds. So probably we can just pass in TSTART and TEND as seconds.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../categories/emacs.html" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../categories/orgmode.html" rel="tag">orgmode</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html" rel="prev" title="Summarizing the clocking time in a journal entry">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-08-11-passing-in-seconds-to-org-clock-sum.html" rel="next" title="Passing in seconds to org-clock-sum">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
